{
  "categories": [
    "WebDev",
    "DataScience",
    "Coding",
    "IT",
    "Media",
    "Office",
    "Studying"
  ],
  "projects": [
    {
      "name": "airsoft machine",
      "desc": "This app contains multiple modes for dynamic airsoft games management",
      "link": "https://play.google.com/store/apps/details?id=com.GhigolusStudio.AirsoftMachine"
    },
    {
      "name": "two souls",
      "desc": "This is a competitive local multiplayer created with Unity",
      "link": "https://play.google.com/store/apps/details?id=com.GhigolusGames.TwoSouls"
    },
    {
      "name": "magic time counter",
      "desc": "This app is a score and time counter for magic:the gathering games",
      "link": "https://play.google.com/store/apps/details?id=com.GhigolusStudio.MagicTimeCounter"
    },
    {
      "name": "board games",
      "desc": "This is a filterable online catalog of owned board games",
      "link": "https://ghigoboardgames.netlify.app/"
    },
    {
      "name": "pokestats training",
      "desc": "This is an API based Pokemon webapp made in react and tailwind",
      "link": "https://pokestatsgame.netlify.app/"
    },
    {
      "name": "tellstones lab",
      "desc": "This is a fan-made remake of tellstones board game by Riot Games",
      "link": "https://tellstoneslab.netlify.app/"
    },
    {
      "name": "audiobook player",
      "desc": "This is an audiobook player that saves books status",
      "link": "https://ghigobook.netlify.app/"
    },
    {
      "name": "progbars",
      "desc": "This is a npm package that gives APIs for implementing CLI progress bars",
      "link": "https://www.npmjs.com/package/progbars"
    }
  ],
  "certificates": [
    {
      "type": "udemy",
      "name": "Complete C# Masterclass",
      "hours": 45
    },
    {
      "type": "udemy",
      "name": "The Web Developer Bootcamp",
      "hours": 73
    },
    {
      "type": "udemy",
      "name": "Gimp Masterclass",
      "hours": 40
    },
    {
      "type": "udemy",
      "name": "The Git and GitHub Bootcamp",
      "hours": 17
    },
    {
      "type": "udemy",
      "name": "Javascript Algorithms And Data Structures Masterclass",
      "hours": 22
    },
    {
      "type": "udemy",
      "name": "Data Analysis with Pandas and Python",
      "hours": 22
    },
    {
      "type": "udemy",
      "name": "Unity 2d Art",
      "hours": 5
    },
    {
      "type": "udemy",
      "name": "2D Game Artist: Learn GIMP For Game Art",
      "hours": 18
    },
    {
      "type": "udemy",
      "name": "Powerpoint 2019",
      "hours": 9
    },
    {
      "type": "udemy",
      "name": "CompTIA A+ 220-1001",
      "hours": 18
    },
    {
      "type": "udemy",
      "name": "Unity Pro Builder",
      "hours": 16
    },
    {
      "type": "udemy",
      "name": "Beginner Unity Multiplayer",
      "hours": 2
    },
    {
      "type": "udemy",
      "name": "Modern Unity UI with UI Toolkit",
      "hours": 20
    }
  ],
  "skills": [
    {
      "name": "html",
      "type": "WebDev",
      "desc": "I have a solid understanding of HTML and its syntax. I am able to effectively structure content and create semantic markup, which improves accessibility and search engine optimization (SEO).",
      "notes": [
        "this is the note 1",
        "this is the note 2",
        "this is the note 3",
        "this is the note 4",
        "this is the note 5",
        "this is the note 6",
        "this is the note 7",
        "this is the note 8",
        "this is the note 9"
      ]
    },
    {
      "name": "css",
      "type": "WebDev",
      "desc": "I have a strong grasp of CSS and its capabilities, including its box model, layout, and typography features. I am able to use CSS to create responsive designs that work well across different screen sizes and devices.",
      "notes": []
    },
    {
      "name": "js",
      "type": "WebDev",
      "desc": "I have a deep understanding of JavaScript and its core concepts, including variables, functions, loops, and conditionals. I am able to write modular and reusable code, and I am familiar with modern JavaScript frameworks and libraries",
      "notes": []
    },
    {
      "name": "react",
      "type": "WebDev",
      "desc": "I have a strong understanding of React and its core principles, including components, state, and props. I am able to create dynamic and interactive user interfaces using React, and I am familiar with modern React frameworks and libraries.",
      "notes": []
    },
    {
      "name": "tailwind",
      "type": "WebDev",
      "desc": "I have a solid grasp of Tailwind and its utility-first approach to CSS. I am able to use Tailwind to rapidly prototype and design responsive and accessible web interfaces.",
      "notes": []
    },
    {
      "name": "nodejs",
      "type": "WebDev",
      "desc": "I have a deep understanding of Node.js and its capabilities, including its event-driven architecture, non-blocking I/O, and the Node.js runtime environment. I am able to use Node.js to build scalable and high-performance applications.",
      "notes": []
    },
    {
      "name": "express",
      "type": "WebDev",
      "desc": "I have a strong understanding of the Express framework and its middleware system. I am able to create robust and scalable web applications using Express, and I am familiar with modern Express libraries and plugins.",
      "notes": []
    },
    {
      "name": "mongodb",
      "type": "WebDev",
      "desc": "I have a solid grasp of MongoDB and its NoSQL database model. I am able to design and implement scalable and performant database architectures using MongoDB, and I am familiar with modern MongoDB tools and libraries.",
      "notes": []
    },
    {
      "name": "mysql",
      "type": "WebDev",
      "desc": "I have a strong understanding of MySQL and its relational database model. I am able to design and implement complex database schemas and queries using MySQL, and I am familiar with modern MySQL tools and libraries.",
      "notes": []
    },
    {
      "name": "docker",
      "type": "WebDev",
      "desc": "I have a deep understanding of Docker and its containerization technology. I am able to use Docker to create isolated and portable development and production environments, and I am familiar with modern Docker tools and platforms.",
      "notes": []
    },
    {
      "name": "npm",
      "type": "WebDev",
      "desc": "I have a strong understanding of npm and its package management capabilities. I am able to use npm to install and manage dependencies, as well as publish and distribute packages to the wider developer community.",
      "notes": []
    },
    {
      "name": "bootstrap",
      "type": "WebDev",
      "desc": "I have a solid grasp of Bootstrap and its responsive grid system and UI components. I am able to use Bootstrap to rapidly prototype and design modern and accessible web interfaces.",
      "notes": []
    },
    {
      "name": "postman",
      "type": "WebDev",
      "desc": "I have a strong understanding of Postman and its API development and testing capabilities. I am able to use Postman to create and test APIs, as well as collaborate with team members on API development.",
      "notes": []
    },
    {
      "name": "jquery",
      "type": "WebDev",
      "desc": "I have a solid grasp of jQuery and its DOM manipulation and event handling features. I am able to use jQuery to create dynamic and interactive web interfaces, and I am familiar with modern jQuery plugins and libraries.",
      "notes": []
    },
    {
      "name": "dbdesign",
      "type": "IT",
      "desc": "Experienced in database design, with expertise in designing efficient and scalable database schemas. Proficient in utilizing relational database management systems (RDBMS) and understanding concepts such as table normalization, indexing, and query optimization. Skilled in designing databases that meet specific business requirements while ensuring data integrity and performance.",
      "notes": []
    },
    {
      "name": "csharp",
      "type": "Coding",
      "desc": "I have a strong understanding of C# and its object-oriented programming concepts, including classes, inheritance, and polymorphism. I am able to create scalable and performant applications using C# and modern .NET frameworks and libraries.",
      "notes": []
    },
    {
      "name": "unity",
      "type": "Coding",
      "desc": "I have a solid grasp of Unity and its game development features, including its physics engine, scripting API, and cross-platform deployment capabilities. I am able to create immersive and interactive 2D and 3D games using Unity.",
      "notes": []
    },
    {
      "name": "git",
      "type": "Coding",
      "desc": "I have a deep understanding of Git and its version control features, including branching, merging, and conflict resolution. I am able to use Git to manage code changes and collaborate effectively with other developers.",
      "notes": []
    },
    {
      "name": "github",
      "type": "Coding",
      "desc": "I have a strong understanding of GitHub and its code hosting and collaboration features, including issue tracking, pull requests, and continuous integration. I am able to use GitHub to contribute to open source projects and manage personal and team repositories.",
      "notes": []
    },
    {
      "name": "python",
      "type": "Coding",
      "desc": "I have a solid grasp of Python and its syntax, data structures, and built-in libraries. I am able to create scalable and efficient applications using Python, and I am familiar with modern Python frameworks and libraries.",
      "notes": []
    },
    {
      "name": "selenium",
      "type": "Coding",
      "desc": "I have a solid grasp of Selenium and its syntax. I am able to gather data from a lot of different website layout and create automation scripts.",
      "notes": []
    },
    {
      "name": "pandas",
      "type": "DataScience",
      "desc": "I have a solid grasp of Pandas and its data manipulation and analysis features in Python. I am able to use Pandas to clean, transform, and analyze large datasets efficiently and effectively.",
      "notes": []
    },
    {
      "name": "numpy",
      "type": "DataScience",
      "desc": "Proficient in NumPy, a powerful Python library for numerical computing. Skilled in utilizing its array-based computing functionalities, mathematical operations, and data manipulation techniques to efficiently process and analyze large datasets.",
      "notes": []
    },
    {
      "name": "matplotlib",
      "type": "DataScience",
      "desc": "Skilled in using Matplotlib, a popular data visualization library in Python. Proficient in creating various types of charts, plots, and graphs to effectively communicate data insights. Capable of customizing visualizations to match specific requirements and enhance data storytelling.",
      "notes": []
    },
    {
      "name": "jupyter",
      "type": "DataScience",
      "desc": "Experienced in working with Jupyter notebooks, an interactive computational environment that allows for code execution, data visualization, and collaboration. Proficient in leveraging Jupyter's features to create and share interactive data analysis, machine learning models, and data visualization projects.",
      "notes": []
    },
    {
      "name": "beautsoup",
      "type": "DataScience",
      "desc": "Proficient in Beautiful Soup, a Python library used for web scraping and parsing HTML/XML documents. Skilled in extracting structured data from websites, navigating the HTML structure, and performing data extraction tasks with ease. Experienced in automating data collection processes using Beautiful Soup.",
      "notes": []
    },
    {
      "name": "vba",
      "type": "DataScience",
      "desc": "I have a strong understanding of VBA and its scripting capabilities in Microsoft Office applications. I am able to create macros and automate repetitive tasks in Excel and other Office applications using VBA.",
      "notes": []
    },
    {
      "name": "scripting",
      "type": "Coding",
      "desc": "I have a deep understanding of scripting languages and their use cases, including Python, Bash, and PowerShell. I am able to create scripts to automate repetitive tasks and streamline workflows.",
      "notes": []
    },
    {
      "name": "sql",
      "type": "Coding",
      "desc": "I have a strong understanding of SQL and its relational database model. I am able to create and query databases using SQL, and I am familiar with modern SQL frameworks and libraries.",
      "notes": []
    },
    {
      "name": "sqlite",
      "type": "Coding",
      "desc": "I have a solid grasp of SQLite and its lightweight and portable database features. I am able to create and manage SQLite databases for local and mobile applications.",
      "notes": []
    },
    {
      "name": "lua",
      "type": "Coding",
      "desc": "I have built some retrò devices with this programming language",
      "notes": []
    },
    {
      "name": "regex",
      "type": "Coding",
      "desc": "I have a strong understanding of regular expressions and their syntax and usage. I am able to use regular expressions to search, match, and manipulate text efficiently and effectively.",
      "notes": []
    },
    {
      "name": "markdown",
      "type": "Coding",
      "desc": "I have a solid grasp of Markdown and its syntax for formatting and structuring text. I am able to create and publish content using Markdown in various contexts, including documentation and blogging.",
      "notes": []
    },
    {
      "name": "kotlin",
      "type": "Coding",
      "desc": "I have a deep understanding of Kotlin and its object-oriented and functional programming features. I am able to create scalable and efficient applications using Kotlin and modern Android frameworks and libraries.",
      "notes": []
    },
    {
      "name": "datastruct",
      "type": "Coding",
      "desc": "I have a strong understanding of data structures and their implementation and usage, including arrays, linked lists, stacks, queues, trees, and graphs. I am able to choose and implement appropriate data structures for various algorithms and applications.",
      "notes": []
    },
    {
      "name": "raspberry",
      "type": "Coding",
      "desc": "I have a solid grasp of Raspberry Pi and its hardware and software capabilities. I am able to use Raspberry Pi to create and deploy various applications, including IoT and robotics",
      "notes": []
    },
    {
      "name": "crypto",
      "type": "IT",
      "desc": "Knowledgeable in cryptography principles and algorithms, including symmetric and asymmetric encryption, digital signatures, and secure key management. Skilled in implementing encryption and decryption techniques in Python to ensure data confidentiality, integrity, and authenticity.",
      "notes": []
    },
    {
      "name": "arduino",
      "type": "Coding",
      "desc": "I have a strong understanding of Arduino and its microcontroller and programming features. I am able to use Arduino to create and deploy various applications, including IoT and robotics.",
      "notes": []
    },
    {
      "name": "linux",
      "type": "IT",
      "desc": "I have a deep understanding of Linux and its architecture, command-line interface, and system administration features. I am able to manage and configure Linux-based servers and workstations for various use cases, including web hosting and development.",
      "notes": []
    },
    {
      "name": "ssh",
      "type": "IT",
      "desc": "I have a solid grasp of SSH and its secure remote access features. I am able to use SSH to connect to and manage remote servers and workstations securely and efficiently.",
      "notes": []
    },
    {
      "name": "vim",
      "type": "IT",
      "desc": "I have a strong understanding of Vim and its powerful text editing and manipulation features. I am able to use Vim to edit and navigate text files efficiently and effectively, and I am familiar with various Vim plugins and configurations.",
      "notes": []
    },
    {
      "name": "networking",
      "type": "IT",
      "desc": "I have a deep understanding of computer networking and its concepts and protocols, including TCP/IP, DNS, DHCP, and HTTP. I am able to troubleshoot and configure network connections and devices, and I am familiar with modern networking technologies and trends.",
      "notes": []
    },
    {
      "name": "OS",
      "type": "IT",
      "desc": "I have a strong understanding of operating systems and their architecture, features, and usage. I am able to choose and configure appropriate operating systems for various applications and workloads, and I am familiar with modern operating systems and their trends.",
      "notes": []
    },
    {
      "name": "digitalocean",
      "type": "IT",
      "desc": "I have a solid grasp of DigitalOcean and its cloud hosting and infrastructure features. I am able to deploy and manage virtual servers and containers on DigitalOcean, and I am familiar with its various integrations and APIs.",
      "notes": []
    },
    {
      "name": "GPC",
      "type": "IT",
      "desc": "Experienced in harnessing the power of Google Play Console to manage and optimize Unity-based mobile applications. Proficient in integrating leaderboards, implementing effective price management strategies.",
      "notes": []
    },
    {
      "name": "pcrepair",
      "type": "IT",
      "desc": "I have a deep understanding of PC hardware and software troubleshooting and repair. I am able to diagnose and resolve various PC issues, including hardware failures, software errors, and virus infections.",
      "notes": []
    },
    {
      "name": "webcrawling",
      "type": "IT",
      "desc": "I have a solid grasp of web crawling and its techniques and tools, including Python's Beautiful Soup and Scrapy frameworks. I am able to scrape and extract data from various websites efficiently and effectively, and I am familiar with ethical and legal considerations of web crawling.",
      "notes": []
    },
    {
      "name": "revit",
      "type": "Media",
      "desc": "I have a strong understanding of Revit and its features for building information modeling (BIM). I am able to create and edit 3D models of buildings and structures, and I am familiar with Revit's various tools and plugins for design, analysis, and documentation.",
      "notes": []
    },
    {
      "name": "autocad",
      "type": "Media",
      "desc": "I have a solid grasp of AutoCAD and its features for computer-aided design (CAD). I am able to create and edit 2D and 3D drawings of various designs and structures, and I am familiar with AutoCAD's various tools and workflows for drafting, annotation, and collaboration.",
      "notes": []
    },
    {
      "name": "blender",
      "type": "Media",
      "desc": "I have a strong understanding of Blender and its features for 3D modeling, animation, and rendering. I am able to create and edit 3D models and animations of various designs and characters, and I am familiar with Blender's various tools and workflows for rigging, texturing, and compositing.",
      "notes": []
    },
    {
      "name": "gimp",
      "type": "Media",
      "desc": "I have a solid grasp of GIMP and its features for raster graphics editing and manipulation. I am able to create and edit images and graphics for various applications and media, and I am familiar with GIMP's various tools and workflows for layering, color correction, and filtering.",
      "notes": []
    },
    {
      "name": "inkscape",
      "type": "Media",
      "desc": "I have a strong understanding of Inkscape and its features for vector graphics editing and manipulation. I am able to create and edit scalable and high-quality images and graphics for various applications and media, and I am familiar with Inkscape's various tools and workflows for path editing, text manipulation, and object transformation.",
      "notes": []
    },
    {
      "name": "krita",
      "type": "Media",
      "desc": "I have a solid grasp of Krita and its features for digital painting and drawing. I am able to create and edit paintings and illustrations for various applications and media, and I am familiar with Krita's various tools and workflows for brush creation, color management, and animation.",
      "notes": []
    },
    {
      "name": "audacity",
      "type": "Media",
      "desc": "I have a strong understanding of Audacity and its features for digital audio editing and manipulation. I am able to create and edit audio recordings and tracks for various applications and media, and I am familiar with Audacity's various tools and workflows for noise reduction, equalization, and effects processing.",
      "notes": []
    },
    {
      "name": "resolve",
      "type": "Media",
      "desc": "I have a solid grasp of DaVinci Resolve and its features for video editing, color correction, and post-production. I am able to create and edit video footage and sequences for various applications and media, and I am familiar with DaVinci Resolve's various tools and workflows for color grading, audio mixing, and visual effects.",
      "notes": []
    },
    {
      "name": "excel",
      "type": "Office",
      "desc": "I have a strong understanding of Excel and its features for data analysis, management, and visualization. I am able to create and manipulate spreadsheets, use formulas and functions to perform calculations, and create charts and graphs to present data.",
      "notes": []
    },
    {
      "name": "word",
      "type": "Office",
      "desc": "I have a solid grasp of Word and its features for document creation, editing, and formatting. I am able to create and edit documents, use styles and templates to apply consistent formatting, and use tools such as spelling and grammar check to ensure accuracy.",
      "notes": []
    },
    {
      "name": "outlook",
      "type": "Office",
      "desc": "I have a strong understanding of Outlook and its features for email management, scheduling, and communication. I am able to manage email accounts, create and schedule appointments and meetings, and use features such as rules and filters to organize and prioritize emails.",
      "notes": []
    },
    {
      "name": "access",
      "type": "Office",
      "desc": "I have a solid grasp of Access and its features for database creation, management, and reporting. I am able to create and manipulate databases, use queries and filters to extract data, and create forms and reports to present data in a user-friendly manner.",
      "notes": []
    },
    {
      "name": "publisher",
      "type": "Office",
      "desc": "I have a strong understanding of Publisher and its features for desktop publishing, design, and layout. I am able to create and edit professional-looking publications such as brochures, flyers, and newsletters, use templates and styles to apply consistent formatting, and add images and graphics to enhance the visual appeal.",
      "notes": []
    },
    { "name": "postgre", "type": "Studying", "desc": "", "notes": [] },
    { "name": "socketio", "type": "Studying", "desc": "", "notes": [] },
    { "name": "electron", "type": "Studying", "desc": "", "notes": [] },
    { "name": "svelte", "type": "Studying", "desc": "", "notes": [] },
    { "name": "flask", "type": "Studying", "desc": "", "notes": [] },
    { "name": "jwt", "type": "Studying", "desc": "", "notes": [] },
    { "name": "typescript", "type": "Studying", "desc": "", "notes": [] },
    { "name": "nextjs", "type": "Studying", "desc": "", "notes": [] },
    { "name": "kubernetes", "type": "Studying", "desc": "", "notes": [] },
    { "name": "nginx", "type": "Studying", "desc": "", "notes": [] },
    { "name": "redis", "type": "Studying", "desc": "", "notes": [] }
  ]
}
